//
//  Groupes.swift
//  Spy
//
//  Created by Илья Тюрин on 27.08.2021.
//

enum Groupes: String {
    case allLocations = "Все локации"
    case coutries = "Страны"
    case sports = "Спорт"
    case travels = "Путешествия"
    case culture = "Культура"
    case child = "Дети"
    case timeMachine = "Машина времени"
    case adult = "Для взрослых"
    
    var allLocation: [String] {
        Groupes.coutries.definition +
            Groupes.sports.definition +
            Groupes.travels.definition +
            Groupes.culture.definition +
            Groupes.child.definition +
            Groupes.timeMachine.definition +
            Groupes.adult.definition
    }
    
    var definition: [String] {
        switch self {
        case .coutries:
            return ["Россия", "Беларусь", "Япония", "США", "Украина", "Великобритания", "Франция", "Италия", "Китай", "Индия", "Канада", "Греция", "Южная Корея", "Турция", "Нигер", "Ирак", "ЮАР", "Мексика", "Чили", "Аргентина", "Куба", "Доминикана", "Бразилия", "Исландия", "Германия", "Египет", "Саудовская Аравия", "Казахстан", "Австралия"]
        case .sports:
            return ["Спортивная площадка", "Поле для гольфа", "Футбольный стадион", "Серфинг", "Хоккейная арена", "Бассейн", "Гоночный трек", "Тренажерный зал", "Теннисный корт", "Велосипедная дорожка", "Пляжный воллейбол", "Трасса для мото-кросса", "Ралли", "Трамплин для прыжков в воду", "Бобслей", "Горнолыжный спуск", "Октагон"]
        case .travels:
            return ["Самолет", "Корабль", "Подводная лодка", "Автобус", "Трамвай", "Космический корабль", "Метро", "Поезд", "Автомобиль", "Такси", "Скейтборд", "Хостел", "Отель", "Палатка", "Пляж", "Автосервис"]
        case .culture:
            return ["Галерея", "Музей", "Театр", "Планетарий", "Кинотеатр", "Выставка", "Концертный зал", "Экскурсия", "Палеонтологический музей", "Ресторан", "Церковь", "Корпоративная вечеринка", "Казино"]
        case .child:
            return ["Детская площадка", "Школа", "Детский сад", "Зоопарк", "Каток", "Цирк", "Пиццерия", "Урок физкультуры", "Урок труда", "Торговый центр", "День рождения", "За гаражами", "Батутный центр", "Лазертаг", "Парк аттракционов"]
        case .timeMachine:
            return ["Первая мировая война", "Вторая мировая", "Древняя греция", "Древний Рим", "Город будущего", "1980-е", "1990-е", "2000-е", "СССР", "Средневековье", "Дикий запад", "Каменный век", "Мезозой", "Палеолит"]
        case .adult:
            return ["Стрип-клуб", "Гей-клуб", "Интим-магазин", "Дом престарелых", "Общага", "Тюрьма", "Массажный салон", "Спальня", "Курилка", "Вытрезвитель", "Общество анонимных алкоголиков"]
        case .allLocations:
            return allLocation
        }
    }
    
}
